Dlubal.RFEM5.LineSupport
Line support parameters

Dlubal.RFEM5.LineSupport.No
Number

Dlubal.RFEM5.LineSupport.ID
Identifier

Dlubal.RFEM5.LineSupport.Comment
Comment

Dlubal.RFEM5.LineSupport.Tag
Tag

Dlubal.RFEM5.LineSupport.IsValid
Information if the object is valid or not (read only)

Dlubal.RFEM5.LineSupport.LineList
List of lines numbers supported by this support

Dlubal.RFEM5.LineSupport.ReferenceSystem
Indicate that reference system is local or global

Dlubal.RFEM5.LineSupport.Rotation
Rotation about x-axis

Dlubal.RFEM5.LineSupport.IsWall
Elastic support via wall in Z

Dlubal.RFEM5.LineSupport.Wall
Wall parameters

Dlubal.RFEM5.LineSupport.SupportConstantX
Support constant uX'

Dlubal.RFEM5.LineSupport.SupportConstantY
Support constant uY'

Dlubal.RFEM5.LineSupport.SupportConstantZ
Support constant uZ'

Dlubal.RFEM5.LineSupport.RestraintConstantX
Restraint constant φX'

Dlubal.RFEM5.LineSupport.RestraintConstantY
Restraint constant φY'

Dlubal.RFEM5.LineSupport.RestraintConstantZ
Restraint constant φZ'

Dlubal.RFEM5.LineSupport.SupportNonlinearityX
Nonlinearity in uX'

Dlubal.RFEM5.LineSupport.SupportNonlinearityY
Nonlinearity in uY'

Dlubal.RFEM5.LineSupport.SupportNonlinearityZ
Nonlinearity in uZ'